{"pages":[{"text":"Живим од свог рада у једној лепој централно-европској земљи.","tags":"page","loc":"http://strn.github.io/page/about.html","title":"О мени"},{"text":"Да бисте ступили са мном у контакт, пошаљите поруку на адресу електронске поште: Адресу намерно дајем у овом облику како бих максимално отежао посао „жетеоцима\" адреса е-поште, били они људи или аутомати :)","tags":"page","loc":"http://strn.github.io/page/contact.html","title":"Контакт"},{"text":"Не, не селим се ја у Сан Аморе - барем не још. Тек треба да га пронађем. О чему се овде, заправо, ради? О једној симпатичној песми коју пева Енди Борг [ Andy Borg ]. Многи ће је прогласити сладуњавом, али искрено баш ме брига. Lang schon war ich auf der Suche nach dem schönsten Platz der Welt die Oase für die Liebe wo man Zärtlichkeiten zählt ich sah Rosen blühn und welken machte da und dort mal Rast jetzt hab ich den Ort gefunden wo ganz einfach alles passt Ich zieh nach San Amore sofort und jetzt und hier will ich in San Amore nur glücklich sein mit dir dort ist der Traum Amore so schön wie ein Gedicht komm mit nach San Amore das bereust du nicht Dieser Ort ist wie geschaffen um für dich ein Schloss zu baun ja hier bleibe ich für immer und hier lieb ich meine Traum wo nur rote Rosen blühen und es niemals Tränen gibt dort bist du in meinen Armen tausend Jahre lang verliebt Ich zieh nach San Amore sofort und jetzt und hier will ich in San Amore nur glücklich sein mit dir dort ist der Traum Amore so schön wie ein Gedicht komm mit nach San Amore das bereust du nicht Liebe für immer statt Sehnsucht auf Zeit dafür ist kein Weg zu weit Ich zieh nach San Amore sofort und jetzt und hier will ich in San Amore nur glücklich sein mit dir dort ist der Traum Amore so schön wie ein Gedicht komm mit nach San Amore das bereust du nicht","tags":"Blog","loc":"http://strn.github.io/post/2015/01/04/selim-se-u-san-amore/","title":"Селим се у Сан Аморе …"},{"text":"Пажљиви читаоци овог блога приметиће могућност остављања коментара после сваког објављеног чланка. С обзиром на статичну природу овог блога, најлакше је било уградити већ постојећи систем за коментарисање. Пеликан у ту сврху промовише Дискус (Disqus). Цепидлаке ће рећи да није најпоштеније имати статички сајт са динамичким коментарима (ако смо статички, онда да смо скроз статички!). Међутим, од овог принципа можемо мало и да одступимо, пошто је Дискус бесплатан за коришћење и релативно једноставан за уградњу у друге сајтове. Дискус је добар и зато што је локализован на већи број језика. По Марфијевом закону, недостајала је локализација која је мени била потребна - на српском језику и српском ћирилицом. Постојала је верзија на хрватској латиници, али се она није уклапала у целокупни изглед „Мудровања\". Суочен са таквом ситуацијом, није било друге него да засучем рукаве и довршим започету локализацију на српски језик. Warning Да, баш је тако како сте прочитали: сав мој допринос Дискусовом појављивању на српској ћирилици јесте довршавање и лекторисање постојеће српске локализације. Ово кажем за случај да се некоме учини како хоћу да себи припишем труд осталих преводилаца. Сви језици на којима је локализација Дискуса у току (али не и сви језици на којима је доступан!) могу се видети на одговарајућој страници Трансифекс -овог сајта. У духу доброкомшијских односа контактирао сам уредника српско-латиничне локализације ( sr@latn ) да видим можемо ли некако да сарађујемо. Колега келе показао се коректним, мада ме је зачудила изјава о „ плану да се прво одради латинични превод, а затим да се […] све пребаци у ћирилицу \". Занимљиво је како прво није почета локализација на ћирилицу, па да се онда све пребаци на латиницу … Све је остало на томе, да ће локализација Дискуса на српски ићи на два донекле паралелна колосека - па ако се сретнемо, у реду. Резултат мог рада може се видети непосредно после овог чланка: Сав текст на Дискусовом widget -у исписан је српским језиком, ћирилицом. Они који хоће да додају Дискусов систем коментара својој страници треба да прате упутства за уградњу дата на самом Дискусовом сајту. Једини додатак Јаваскрипту јесте опција за српски језик (вредност sr у променљивој disqus_config ): < script type = \"text/javascript\" > var disqus_shortname = 'Име вашег сајта на Дискусу' ; var disqus_identifier = 'јединствени-идентификатор-чланка' ; var disqus_title = 'Наслов чланка' ; var disqus_url = 'URL чланка на вашем сајту' ; var disqus_config = function () { this . language = 'sr' ; }; ... < /script>","tags":"Blog","loc":"http://strn.github.io/post/2014/12/14/lokalizacija-disqusa-na-srpski-jezik/","title":"Локализација Disqus-a на српски језик"},{"text":"Блог познат као „Мудровања\" појављивао се ту и тамо у различитим облицима, да би исто тако после неког времена нестајао. То „после неког времена\" ближе је одређено моментом када бих начисто запустио своју инсталацију Вордпреса . Испоставило се да је Вордпрес био превелика апликација за оно што је мени требало - једноставан систем на којем ћу моћи да напишем по који чланак, додам неку сличицу или опишем неки поступак. Коришћење Вордпреса у таквој ситуацији лепо би могло да се опише изреком „клање вола зарад киле меса\". Пре пар месеци открио сам Пеликан - генератор статичних веб-страница. Све што сада треба да урадим јесте: Да напишем чланак у неком описном језику као што је reStructuredText или Markdown . Намерно сам избегао да поменем AsciiDoc , пошто је подршка за њега у Пеликану прилично нестабилна Да регенеришем сајт Да објавим промене на GitHub -у „Мудровања\" су раније подржавала чланке писане српском ћирилицом и хрватском латиницом. То је остварено аутоматским пресловљавањем на латиницу. Но, с обзиром да се држим начела „један језик - једно писмо\" од аутоматског пресловљавања сам одустао. Тако су „Мудровања\" у овој „реинкарнацији\" доступна само на српској ћирилици. Ако нађем неку копију базе из ранијих времена, тада објављене чланке уредно ћу разврстати хронолошки и ставити овде, на блог.","tags":"Blog","loc":"http://strn.github.io/post/2014/12/12/istorija-mudrovanja/","title":"Кратка историја „Мудровања\""}]}